# Relaciones entre tablas

Uno de los objetivos de un buen diseño de base de datos es eliminar la redundancia de los datos (datos duplicados). Para conseguirlo, conviene desglosar los datos en muchas tablas basadas en temas para que cada hecho esté representado solo una vez. Después, se debe proveer a Access de un medio para recopilar de nuevo la información desglosada (esto se realiza colocando campos comunes en tablas que estén relacionadas). Sin embargo, para realizar este paso correctamente, primero debe conocer las relaciones existentes entre las tablas y, a continuación, especificar dichas relaciones en la base de datos.

**Una relación uno a varios**

Usemos como ejemplo una base de datos de seguimiento de pedidos que incluya una tabla Clientes y una tabla Pedidos. Un cliente puede realizar cualquier número de pedidos. Por cada cliente representado en la tabla Clientes puede haber representados muchos pedidos en la tabla Pedidos. Por lo tanto, la relación entre la tabla Clientes y la tabla Pedidos es una relación de uno a varios.


**Una relación varios a varios**

Centrémonos ahora en la relación entre una tabla Productos y una tabla Pedidos. Un solo pedido puede incluir varios productos. Por otra parte, un único producto puede aparecer en muchos pedidos. Por tanto, por cada registro de la tabla Pedidos puede haber varios registros en la tabla Productos. Además, por cada registro de la tabla Productos puede haber varios registros en la tabla Pedidos. Esta relación se denomina relación de varios a varios. Tenga en cuenta que para detectar las relaciones de varios a varios existentes entre las tablas, es importante que considere ambas partes de la relación.

**Una relación uno a uno**

En una relación uno a uno, cada registro de la primera tabla solo puede tener un registro coincidente en la segunda tabla y viceversa. Esta relación no es común porque la mayor parte de las veces la información relacionada de este modo se almacena en la misma tabla. Puede usar la relación uno a uno para dividir una tabla con muchos campos, para aislar parte de una tabla por razones de seguridad o para almacenar información que solo se aplica a un subconjunto de la tabla principal. Cuando identifique esta relación, ambas tablas deben compartir un campo común.

**PRACTICA**

In [3]:
import pandas as pd

In [4]:
data = {'Gender':['m','f','f','m','f','m','m'],'Height':[172,171,169,173,170,175,178]}
df_sample = pd.DataFrame(data)
df_sample

  Gender  Height
0      m     172
1      f     171
2      f     169
3      m     173
4      f     170
5      m     175
6      m     178

Genere dos df diferentes. El primero debe contener solo los valores femeninos y otro solo los valores masculinos

Calcule el promedio de altura para cada genero

Utilizando group by calcule el promedio por genero.

In [7]:
data = {'Gender':['m','f','f','m','f','m','m'],'Name':['Carlos','Ana','Julia','Pedro','Carla','Juan','Luis']}
df_name = pd.DataFrame(data)
df_name

  Gender    Name
0      m  Carlos
1      f     Ana
2      f   Julia
3      m   Pedro
4      f   Carla
5      m    Juan
6      m    Luis

**Llave primaria** Es el valor UNICO de cada fila que nos ayuda a unir dos tablas

**LLave foranea** Son los valores "importados" de otra tabla

In [11]:
df_name ["PK"] = [0,1,2,3,4,5,6]
df_name

  Gender    Name  PK
0      m  Carlos   0
1      f     Ana   1
2      f   Julia   2
3      m   Pedro   3
4      f   Carla   4
5      m    Juan   5
6      m    Luis   6

In [12]:
df_sample ["PK"] = [0,1,2,3,4,5,6]
df_sample

  Gender  Height  PK
0      m     172   0
1      f     171   1
2      f     169   2
3      m     173   3
4      f     170   4
5      m     175   5
6      m     178   6

In [16]:
resultado = pd.merge(df_sample,
                     df_name, on = ['PK','Gender'])

resultado

  Gender  Height  PK    Name
0      m     172   0  Carlos
1      f     171   1     Ana
2      f     169   2   Julia
3      m     173   3   Pedro
4      f     170   4   Carla
5      m     175   5    Juan
6      m     178   6    Luis